//*********************************************************************
//
//			LCD硬件驱动程序-KS0108控制器128*64点阵支持
//
//*********************************************************************/

#ifndef __LCD_DRV_H
#define __LCD_DRV_H

/****************************************************************************
							相关配置															 
****************************************************************************/


#define     LCD_DEV_WIDTH    128 //显示屏宽度
#define     LCD_DEV_HIGH     64 //显示屏高度    

/******************************************************************************
                            IO回调函数实现
*******************************************************************************/
//这里定义各控制器的片选,无该片选时注释掉即可不编译进入

//各片选统一初始化
#define LcdDev_CsInit()   do{}while(0)

//片选0操作:左半屏
#define LcdDev_SetCs0()   do{}while(0)
#define LcdDev_ClrCs0()   do{}while(0)

//片选1操作:右半屏
#define LcdDev_SetCs1()   do{}while(0)
#define LcdDev_ClrCs1()   do{}while(0)

/****************************************************************************
							函数																 
****************************************************************************/

//-------------------------模块初始化---------------------------------------
void Lcd_Drv_Init(void);	

/****************************************************************************
							回调函数																 
****************************************************************************/

//----------------------延时时间控制--------------------------
//void Lcd_cbDelayUs(unsigned char Us);
//void Lcd_cbDelayMs(unsigned char Ms);
//直接实现:
#include    "math_2.h"
#define Lcd_cbDelayUs(Us)  Delay40Ns((unsigned int)(Us) * 10)
#define Lcd_cbDelayMs(Ms)  Delay40Ns((unsigned int)(Ms) * 10000)

#endif

