/* ----------------------------------------------------------------------------
 *                用户自定义字－GB2312实现
 *此模块适用于不带字库的LCD显示屏，用自定义字实现
 * --------------------------------------------------------------------------*/

//-------------用户自定义全角字符-GB2312查找表(顺序排序)------------------
//此查找表以GB2312为基础接先后顺序排列,每两个字当成一个字符
//其中,带"★"标识符的为系统保留字符
//附GB2312字符查找表
const char TWord_GB2312LUT[] = 
{
  "○"		//★【A1F0】,单选框,不选中
  "●"		//★【A1F1】,单选框,选中
  "□"		//★【A1F5】,复选框,不选中
  "■"		//★【A1F6】,复选框,选中
  "→"		//★【A1FA】,TWidget水平滚动条
  "←"		//★【A1FB】,TWidget水平滚动条
  "↑"		//★【A1FC】,TWidget垂直滚动条
  "↓"		//★【A1FD】,TWidget垂直滚动条
  "─"		//★【A9A4】,TWidget框架
  "━"		//★【A9A5】,TWidget水平滚动条
  "│"		//★【A9A6】,TWidget框架
  "┃"		//★【A9A7】,TWidget垂直滚动条
  "┌"		//★【A9B0】,TWidget框架 
  "┐"		//★【A9B4】,TWidget框架
  "└"		//★【A9B8】,TWidget框架
  "┘"		//★【A9BC】,TWidget框架
  "├"		//★【A9C0】,TWidget提示    
  "┤"		//★【A9C8】,TWidget提示  
  "┬"		//★【A9D0】,TWidget提示      
  "┴"		//★【A9D8】,TWidget提示   
  "┼"		//★【A9E0】,TWidget提示    
  "保"		//  【B1A3】,保存按钮 
  "出"		//  【B3F6】,退出按钮    
  "存"		//  【B4E6】,保存按钮
  "进"		//  【BDF8】,进入按钮 
  "入"		//  【C8EB】,退出按钮     
  "退"		//  【CDCB】,退出按钮
};

//-------------------得到其大小-----------------------------
unsigned short TWord_GetGB2312LUTSize(void)
{
  return sizeof(TWord_GB2312LUT) - 1;
}

