//*********************************************************************
//
//			LCD硬件驱动程序
//
//*********************************************************************/

#ifndef __LCD_DRV_H
#define __LCD_DRV_H



//-----------------lcd初始化---------------------------------
//是否允许清屏标志,不清屏时将显示LOGO
void LcdInit(unsigned char EnInitScreen);



/****************************************************************************
							回调函数																 
****************************************************************************/

//--------------------------开机LOGO显示--------------------------
//用于开机显示LOGO
void Lcd_cbLogo(void);

//----------------------延时时间控制--------------------------
//void Lcd_cbDelayUs(unsigned char Us);
//void Lcd_cbDelayUs(unsigned char Ms);
//直接实现:
#include    "ShareFun.h"
#define Lcd_cbDelayUs(Us)  DelayUs(Us)
#define Lcd_cbDelayMs(Ms)  DelayUs(Ms)

#endif