/* ----------------------------------------------------------------------------

 *                TGUI消息通报-在禁止使用函数指针时实现

 * --------------------------------------------------------------------------*/

#include"TMenuNotify.h"

//包含的外部控件回调函数文件:
#include "MenuResorce.h"

//----------------TMenu消息传递不支持函数指针的替换函数------------------
void TMenupFunReplace(unsigned char Type,//通报类型
                      //根据菜单类型输入的输入输出数据区
                      //该区域结构在控件里定义,直接指针转换即可
                      void *pv,
                       TMenuNotify_t ID)   // 回调函数ID号
{

}
