/*****************************************************************************

                   TGUI上的输入法模块-大小写输入法部分

*****************************************************************************/
#ifndef __TIME_CAPITAL_H
#define __TIME_CAPITAL_H

/*****************************************************************************
                        相关定义
*****************************************************************************/

#define TIME_CAPITAL_YZ_TIMER_OV   8     //yz字符母选择定时器超时值,128ms为单位


/*****************************************************************************
                        相关结构
*****************************************************************************/

struct _TImeCapital{
  unsigned char FirstKey;          //第一次输入的键值,0-4
  unsigned char yzTimer;           //yz字符母选择定时器  
  unsigned char Flag;              //相关标志，见定义
  char CharBuf[4];                 //用于返回字符的临时缓冲区  
};

//相关标志定义为:
#define TIME_CAPITAL_CAPITAL    0x80    //大写状态，否则为小写
#define TIME_CAPITAL_SEL_CHAR  0x40    //选择字母状态，否则为选择分组

/*****************************************************************************
                        相关函数
*****************************************************************************/

//---------------------------初始化函数---------------------------------
//切换到符号输入法时调用
void TImeCapital_Init(struct _TImeCapital *pCapital,//输入法结构
                      unsigned char CapitalFlag);   //大写输入模式标志

//-------------------------填充用户提示(抬头)-----------------------------------
//如：选择分组：
void TImeCapital_FullTitle(const struct _TImeCapital *pCapital,//输入法结构
                           char *pStr);

//-------------------------得到对应键值字符函数-----------------------------------
//如：上键对应 返回NULL表示不需要字符
const char *TImeCapital_pGetArrowNotice(struct _TImeCapital *pCapital,//输入法结构
                                         unsigned char GuideKey);//对应键值位置

//--------------------------按键响应函数-----------------------------------
//若修改完成，则返回对应字符，否则0: 不修改返回,  0xffff: 内部操作过程中 
unsigned short TImeCapital_Key(struct _TImeCapital *pCapital,
                                 unsigned char GuideKey);//导航键值0-5

//-----------------------------任务函数----------------------------------
//128ms调用一次, 若修改完成，返回对应输入完成的字符，否则0不处理, 0xffff:强制刷屏
unsigned short TImeCapital_Task(struct _TImeCapital *pCapital);


#endif //#define __TIME_CAPITAL_H

