/*****************************************************************************

                  TGUI上的输入法模块-数字键输入法部分

*****************************************************************************/
#ifndef __TIME_NUM_H
#define __TIME_NUM_H

/*****************************************************************************
                        相关定义
*****************************************************************************/

#define TIME_NUM_TIMER_OV   8     //数字选择定时器超时值,128ms为单位


/*****************************************************************************
                        相关结构
*****************************************************************************/
#include "TImeBase.h" //TIme_String_t;

struct _TImeNum{
  unsigned char FirstKey;  //第一次输入的键值,0-4
  unsigned char NumTimer;  //数字选择定时器  
};

/*****************************************************************************
                        相关函数
*****************************************************************************/

//---------------------------初始化函数---------------------------------
//切换到拼音输入法或上个汉字输入完成后调用
void TImeNum_Init(struct _TImeNum *pNum); //输入法结构

//-------------------------填充用户提示(抬头)-----------------------------------
void TImeNum_FullTitle(const struct _TImeNum *pNum,//输入法结构
                           char *pStr);

//-------------------------得到对应键值字符函数-----------------------------------
//如：上键对应 返回NULL表示不需要字符
const char *TImeNum_pGetArrowNotice(struct _TImeNum *pNum,//输入法结构
                                         unsigned char GuideKey);//对应键值位置

//--------------------------按键响应函数-----------------------------------
//若修改完成，则返回对应字符，否则0: 不修改返回,  0xffff: 内部操作过程中 
unsigned short TImeNum_Key(struct _TImeNum *pNum, unsigned char GuideKey);

//-----------------------------任务函数----------------------------------
//128ms调用一次, 若修改完成，返回对应输入完成的数字，否则0不处理, 0xffff:强制刷屏
unsigned short TImeNum_Task(struct _TImeNum *pNum);

#endif //#define __TIME_NUM_H