/*****************************************************************************

                         TGUI上的输入法模块拼音输入法部分
此模块继承PinYinIME模块完成拼音输入法的输入与显示

*****************************************************************************/
#ifndef __TIME_PINYIN_H
#define __TIME_PINYIN_H

/*****************************************************************************
                              说明
*****************************************************************************/
//内部显示见TIme_ReadMe.h拼音输入法部分


/*****************************************************************************
                        相关定义
*****************************************************************************/

//定义抬头的拼音显示宽度
#define TIME_PINGYING_DISP_W      (30 - 4) //4为边界

//定义空闲时循环显示一周期时间,128ms为单位
#define TIME_PINGYING_IDIE_DISP_OV   (8 * 4)

//拼音第二次选择定时器超时值,128ms为单位
#define TIME_NUM_TIMER_OV   8     

/*****************************************************************************
                        相关结构
*****************************************************************************/
#include "PinYinIME.h" //PinYinIME_t;

//状态机
enum _eTImePinYin{
  //空闲状态，即未输出任何拼音状态，提示"拼音：快速按两次为第二组"等
  eTImePinYin_Idie = 0,
  //拼音输入状态，即正在输入拼音字母，应提示"如"以让用户知道输入结果了
  eTImePinYin_Input = 1,
  //拼音选择状态，即在输入拼音字母确认后选择那个拼音，应提示"拼音->拼音选择"
  eTImePinYin_PinYinSel = 2,  
  //汉字选择状态，即在输入拼音字母确认后选择那个拼音，应提示"拼音->汉字选择"
  eTImePinYin_ChSel = 3,
};

struct _TImePinYin{
  PinYinIME_t Ime;              //继承的结构
  unsigned char PinYinStart;  //拼音显示起始位置,多个拼音显示不全时用于多页显示
  unsigned char ChStart;      //汉字显示起始位置,半字为单位
  unsigned char CurPinYin;    //当前选择的拼音字索引位置

  unsigned char CurPage;       //拼音选择时当前页位置
  enum _eTImePinYin eState;      //状态机
  //导航输入法专用
  unsigned char Timer;         //各状态需要的定时器
  unsigned char FirstKey;      //第一次输入的键值,0-3(不含确认键)
  char ChBuf[10 + 2];            //用于返回汉字的临时缓冲区

};

/*****************************************************************************
                        相关函数
*****************************************************************************/

//---------------------------初始化函数---------------------------------
//切换到拼音输入法或上个汉字输入完成后调用
void TImePinYin_Init(struct _TImePinYin *pPinYin); //输入法结构

//-------------------------填充用户提示(抬头)-----------------------------------
void TImePinYin_FullTitle(const struct _TImePinYin *pPinYin,//输入法结构
                           char *pStr);

//-------------------------得到对应键值字符函数-----------------------------------
//如：上键对应 返回NULL表示不需要字符
const char *TImePinYin_pGetArrowNotice(struct _TImePinYin *pPinYin,//输入法结构
                                         unsigned char GuideKey);//对应键值位置

//--------------------------按键响应函数-----------------------------------
//若修改完成，则返回对应字符，否则0: 不修改返回,  0xffff: 内部操作过程中 
unsigned short TImePinYin_Key(struct _TImePinYin *pPinYin, unsigned char GuideKey);

//-----------------------------任务函数----------------------------------
//128ms调用一次, 若修改完成，返回对应输入完成的数字，否则0不处理, 0xffff:强制刷屏
unsigned short TImePinYin_Task(struct _TImePinYin *pPinYin);

#endif //#define __TIME_PINYIN_H

