/*******************************************************************************

 			            LCD硬件及TGUI显示接口-在TftDrv中的实现
此模块不负责对显示设备的初始化,仅支持单个显示屏
此模块在测试模式时不再刷屏
*******************************************************************************/
#ifndef __LCD_DRV_H
#define __LCD_DRV_H

#include    "TftDrv.h"

/****************************************************************************
							             回调函数																 
****************************************************************************/

//-------------------------该行是否允许更新----------------------------------
//可用于测试模式，或某行在特定情况下当作其它用途使用
unsigned short LCD_Drv_cbLineIsEn(unsigned short y);

//-------------------------得到指定位置文字颜色信息流--------------------------
//每个Color_t表示对应位置起始字的颜色，可用于对显示字进行着色
const Color_t *LCD_Drv_pcbGetPenColor(unsigned char x,      //需要更新的行起始位置
                                      unsigned char y);      //需要更新的行

//--------------------------得到指定位置背景颜色信息流--------------------------
//每个Color_t表示对应位置起始字的背景颜色，可用于对显示字进行着色
const Color_t *LCD_Drv_pcbGetBrushColor(unsigned char x,      //需要更新的行起始位置
                                        unsigned char y);      //需要更新的行

//-------------------------------得到焦点时的背景色-----------------------------
//焦点位置的背景色此以此为标准
Color_t LCD_Drv_cbGetForcusBrushColor(void);



#endif

