/*****************************************************************************
                         TGUI上的输入法模块-数字键输入法部分
*****************************************************************************/
#ifndef __TIME_NUM_H
#define __TIME_NUM_H

/*****************************************************************************
                              说明
*****************************************************************************/
//此函数内部不输出任何显示
//函数调用流程说明:
//1:切换到数字输入法时，调用初始化函数进行初始化操作
//2:用户按数字键时，调用按键处理函数响应按键
//3:得到字符串: 调用得到字符串函数得到显示与输入字符。


/*****************************************************************************
                        相关结构
*****************************************************************************/
#include "TImeBase.h" //TIme_String_t;

struct _TImeNum{
  char Num;    //用户输入的数字键
};

/*****************************************************************************
                        相关函数
*****************************************************************************/

//---------------------------初始化函数---------------------------------
//切换到符号输入法时调用
//void TImeNum_Init(struct _TImeNum *pNum);//输入法结构
#define TImeNum_Init(pNNum) do{}while(0)

//----------------------得到当前用户选择字符函数---------------------------
//返回当前用户选择的字符
//const char TImeNum_GetNum(struct _TImeNum *pNum);
#define TImeNum_GetNum(pNNum)  ((pNNum)->Num)

//-----------------------数字键响应函数---------------------------------
//当用户按数字键0-9时响应用户清求
//void TImeNum_KeyNum(struct _TImeNum *pNum,
//                    char KeyNum);//键值，应确保为'0'-'9'
#define TImeNum_KeyNum(pNNum,KeyNum) do{(pNNum)->Num = KeyNum;}while(0)

#endif //#define __TIME_NUM_H

