/*****************************************************************************
                         TGUI上的输入法模块管理器总接口
注:暂不支持自带字库用要求全角对齐才能显示中文的LCD显示屏的显示
*****************************************************************************/
#ifndef __T_IME_MNG_H
#define __T_IME_MNG_H
/*****************************************************************************
                         说明
*****************************************************************************/
//1.输入法所在TGUI层次关系
//  输入法是一个直接工作在TWM之上的一个高级控件，可认为与TWidget在
//  同一层次，但其功能不可配置(或仅需少量配置)且单一
//2.输入法模块构成:
//  由输入法管理器IME拼音输入法模块，数字输入法模块，大小写输入
//  法模块与符号输入法模块构成，
//3:输入法对TWin窗口的要求:
//  仅需一个独立的TWin窗口，窗口大小最小限定为128*64点，即4行8字，
//  最大要求为192*96点，即6行12字，当给出的TWin超过6行时将在
//  上下显示边界时，将先填充边界，未填充部分填充空格。
//4.

/*****************************************************************************
                          用户配置区
*****************************************************************************/
#define TIME_CAPITAL_TIME_OV      4    //定义在符号输入法时，字符输入起时时间

/*****************************************************************************
                        相关宏定义
*****************************************************************************/
//用来定义输入法类型,具体数值内部已固定好
#define TIME_TYPE_PINYIN    0    //拼音输入法
#define TIME_TYPE_NUM       1    //数字输入法
#define TIME_TYPE_LOWERCASE 2    //小写字母输入法
#define TIME_TYPE_CAPITAL   3    //大写字母输入法
#define TIME_TYPE_SIGN      4    //符号输入法

//默认可使用全部输入法时的定义
#define TIME_TYPE_MASK    0xff


/*****************************************************************************
                        相关结构
*****************************************************************************/
#include "TImeEdit.h"
#include "TImeCapital.h"
#include "TImeNum.h"
#include "TImePinYin.h"
#include "TImeSign.h"

//用于存放各输入法内部数据结构
union _TImeUnion{
  struct _TImeCapital Capital;//大小写输入法
  struct _TImeNum Num;   //数字键输入法
  struct _TImePinYin PinYin;   //拼音输入法  
  struct _TImeSign Sign;   //符号输入法    
};

//TIme主结构
#include "TWin.h"
#include "TImeBase.h" //TIme_String_t;

struct _TImeMng{
  TWin_t *pWin;             //当前挂接的窗口
  struct _TImeEdit Edit;    //首行编辑器,含被编号字符串的相关信息
  union _TImeUnion Data;     //用于存放各输入法内部数据结构
  
  const char *pSignTbl;     //暂存带入的符号输入表
  unsigned char CapitalTimer; //大小写输入法定时定时器
  unsigned char w;          //输入法内部有效宽度,>=16,>18时自动显示左右边界
  unsigned char h;          //输入法内部有效高度,>=4,>=6时自动显示上下边界
  
  unsigned char Type;       //当前输入法类型
  unsigned char TypeMask;   //可使用的输入法类型  
  unsigned char Flag;       //相关标志,见定义
};

//其中,相关标志定义为:
#define TIME_PRV_TYPE_MASK 0x0f  //进入符号输入法时，暂存进入前输入法状态
#define TIME_FLAG_STATE    0x10  //标志当前正在输入法内部工作状态
#define TIME_FLAG_SIGN     0x20   //标志当前正在符号输入状态

/*****************************************************************************
                            相关函数
*****************************************************************************/

//----------------------------------初始化函数---------------------------------
//返回是否成功初始化
signed char TImeMng_Init(struct _TImeMng *pIme,  //带入的输入法结构缓冲
                         TWin_t *pWin,             //当前挂接的窗口
                         char *pString,            //用户已存在的字符串,必须以'\0'结尾
                         TIme_String_t Size,     //字符串缓冲区允许大小+1
                         unsigned char DefaultType,   //默认输入法,<4
                         unsigned char TypeMask,//可使用的输入法类型 
                         const char *pSignTbl); //挂接的符号表,为空时使用默认

//----------------------------按键处理函数---------------------------------
//用户按数字键区与导航键区时调用此函数
//返回值定义为: 0正常状态,-1:退出键直接退出;-2:确认键退出
signed char TImeMng_Key(struct _TImeMng *pIme,
                        char Key);          //键值


//--------------------------任务函数---------------------------------
//在有输入法时调用此函数实现时间要求
void TImeMng_Task(struct _TImeMng *pIme);

//-----------------------------退出函数---------------------------------
//用户输入字符确认退出后调用此函数
void TImeMng_Quit(struct _TImeMng *pIme);

#endif //#define __T_IME_MNG_H

