/*****************************************************************************
                         TGUI上的输入法模块-大小写输入法部分
*****************************************************************************/
#ifndef __TIME_CAPITAL_H
#define __TIME_CAPITAL_H

/*****************************************************************************
                              说明
*****************************************************************************/
//此函数内部不输出任何显示
//函数调用流程说明:
//1:切换到大写或小时输入法时，调用初始化函数进行初始化操作
//2:用户按数字键时，调用按键处理函数响应按键,上层应记住是否切换按键标志
//3:得到字符串: 调用得到字符串函数得到显示字符或输入字符。
//4:得到输入字符串:上层在切换按键标志置位时，获得的字符串即是输入字符
//  否则需等待一个超时后,获得的显示字符才是输入字符，超时后注意应调用
//  同键值时复位函数复位此模块
//注:上层应实现一个1S定时器:在此模块键值响应返回切换按键标志时复位，在
//  定时时间到时，得到输入字符后调用复位函数复位


/*****************************************************************************
                        相关结构
*****************************************************************************/

struct _TImeCapital{
  unsigned char CapitalFlag; //大写输入模式标志，否则为小写
  unsigned char Num;          //上次输入的数字键,0-9
  unsigned char NumCount;    //同一数字键索引位置
  unsigned char SameKeyIndex;//相同键值时的计数统计
};

/*****************************************************************************
                        相关函数
*****************************************************************************/

//---------------------------初始化函数---------------------------------
//切换到符号输入法时调用
void TImeCapital_Init(struct _TImeCapital *pCapital,//输入法结构
                      unsigned char CapitalFlag);   //大写输入模式标志

//----------------------得到当前用户选择字符函数---------------------------
//返回当前用户选择的字符
char TImeCapital_GetChar(struct _TImeCapital *pCapital);

//-----------------------数字键响应函数---------------------------------
//当用户按数字键0-9时响应用户清求
//返回是否已切换到了其它按键上面
signed char TImeCapital_KeyNum(struct _TImeCapital *pCapital,
                               char KeyNum);//键值，应确保为'0'-'9'

//--------------------同键值时复位函数---------------------------------
//在按同一按键时，系统超时确认获得字符时调用此函数
//void TImeCapital_SampReset(struct _TImeCapital *pCapital);
#define TImeCapital_SampReset(pCapital) \
  do{(pCapital)->SameKeyIndex = 0;}while(0)

//--------------------得到同一键重复按次函数-------------------------------
//unsigned char TImeCapital_GetSameKeyIndex(struct _TImeCapital *pCapital);
#define TImeCapital_GetSameKeyIndex(pCapital) \
  ((pCapital)->SameKeyIndex)

#endif //#define __TIME_CAPITAL_H

